wisteria-1c/Конфигурация/Catalogs/Подписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Подписи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасшифровкаПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Делегирование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Делегирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факсимиле</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛицаПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНазначения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравоОтозвано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныйКонвертация</Name>
					<Comment>Реквизит используется для переноса данных из РС.ОтветственныеЛица. В последствии будет удален.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействуетНаОсновании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

wisteria-1c/Конфигурация/Catalogs/Подписи/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ФормаТолькоДействующиеПраваПодписи.Пометка = Истина;
	УстановитьУсловноеОформлениеФормы();
	АдаптацияФормыТакси();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПравоПодписиОтозваноПоОшибке(Команда)
	
	ДанныеТекущейСтроки = Элементы.Список.ТекущиеДанные;
	Если НЕ ДанныеТекущейСтроки = Неопределено
		И ДанныеТекущейСтроки.ПравоОтозвано Тогда
		
		ДополнительныеПараметры = Новый Структура("ПодписьОтветственного", ДанныеТекущейСтроки.Ссылка);
		
		ТекстВопроса = НСтр("ru ='Отменить аннулирование права подписи для %1?'");
		ТекстВопроса = СтрШаблон(ТекстВопроса, Строка(ДанныеТекущейСтроки.ФизическоеЛицо));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтменаАннулированияПраваПодписи", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТолькоДействующиеПраваПодписи(Команда)
	
	Элементы.ФормаТолькоДействующиеПраваПодписи.Пометка = НЕ Элементы.ФормаТолькоДействующиеПраваПодписи.Пометка;
	
	Отборы = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	Для каждого ЭлементОтбора Из Отборы Цикл
		
		Если ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
			
			ЭлементОтбора.Использование = Элементы.ФормаТолькоДействующиеПраваПодписи.Пометка;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияФормыТакси()
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Переместить(Элементы.ФормаПравоПодписиОтозваноПоОшибке, КоманднаяПанель);
	Элементы.Переместить(Элементы.ФормаТолькоДействующиеПраваПодписи, КоманднаяПанель);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеФормы()
	
	УсловноеОформление.Элементы.Очистить();
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ЦветТекста",
		ЦветаПалитры.ТекстВторостепеннойНадписиУНФ);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Список.ПравоОтозвано",
		Истина, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, "Наименование,Код");

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтменаАннулированияПраваПодписиНаСервере(ПодписьОтветственного)
	
	Если НЕ ЗначениеЗаполнено(ПодписьОтветственного) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Попытка
		
		ПодписьОтветственногоОбъект = ПодписьОтветственного.ПолучитьОбъект();
		
		ПодписьОтветственногоОбъект.Заблокировать();
		ПодписьОтветственногоОбъект.ПравоОтозвано = Ложь;
		ПодписьОтветственногоОбъект.Записать();
		
	Исключение
		
		ВызватьИсключение НСтр("ru ='Не удалось занять для записи право подписи, возможно элемент используется другим пользователем.'");
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменаАннулированияПраваПодписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ОтменаАннулированияПраваПодписиНаСервере(ДополнительныеПараметры.ПодписьОтветственного);
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
